import re
var = 339741

eye = [":", ";", "X", "8", "="]
nose = ["-", "<", "-{", "<{"]
mouth = ["\(", "\)", "O", "\|", "\\", "/", "P"]

my_smile = r"{}{}{}".format(eye[var % 5], nose[var % 4], mouth[var % 7])
print('Task 1')
print(f'My smile = ;<|\n')


def smile_count(message, smile=my_smile):
    print(f'В сообщении - {message} Количество смайликов: {len(re.findall(smile, message))} ')


smile_count(f'Мой смайлик - ;<|')
smile_count(';<| ;<| ;<| 12475')
smile_count('да ;<| нет ;<)')
smile_count(';<] :<| ;) ;<')
smile_count('hjfsd fdsj jdsj papdwp uid ;<|;<|;<|;<|;<|;<|')

# ----------------------------------------------------------------------------------------------------------------------
print('\nTask 2')
print(f'My var: {var % 6}\n')


def surname_finder(message):
    a = re.findall(r'[А-ЯЁ][а-яё]+\s+[А-ЯЁ]{1}[.][А-ЯЁ]{1}[.]', message)
    d = []
    for i in range(0, len(a)):
        d.append(a[i][:-5])
    d.sort()
    for i in d:
        print(i)
    print('')


surname_finder('Аалакшин П.В.  Балакшин Л.П. Валакшин К.У.')
surname_finder('Генеральному директору ООО "Восход" Сидорову А.Г.')
surname_finder('В списке оказались: Черных А.В. Бугаев С.Ю. и Осолихин Н.Л.')
surname_finder('Письмо было адресовано Сергееву А.М. и Пушкину А.С. Лермонтову М.Ю. Блоку А.А')
surname_finder('Калистратову А.С. Сальникову М.В. Г.С.Коучинг Толстой Л.Н. ')

# ----------------------------------------------------------------------------------------------------------------------
print('Task 3')
print(f'My var: {var % 4}\n')


def vowel_finder(message):
    reg = regex = r"(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьАа]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьИи]+\b)|(\b[" \
                  r"Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьОо]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьУу]+\b)|(\b[" \
                  r"Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЫы]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЭэ]+\b)|(\b[" \
                  r"Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЕе]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЁё]+\b)|(\b[" \
                  r"Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЮю]+\b)|(\b[Б-ДЖЗЙ-НП-ТФ-ЩЪЬб-джзй-нп-тф-щъьЯя]+\b) "
    a = re.findall(reg, message)
    pr = []
    for b in a:
        pr.append(list(filter(None, b))[0])
    pr = sorted(pr, key=len)
    for i in pr:
        print(i)
    print('')


vowel_finder('Классное слово – обороноспособность, которое должно идти после слов: трава и молоко. ')
vowel_finder('Для определения варианта используйте свой табельный номер, которые можно найти в ИСУ ')
vowel_finder('Для своей программы придумайте минимум 5 тестов.')
vowel_finder('Каждый тест является отдельной сущностью, передаваемой  регулярному  выражению  для  обработки.')
vowel_finder('Необходимо найти в нём любой фрагмент, где сначала идёт слово «ВТ», затем не более 4 слов, '
             'и после этого идёт слово «ИТМО». ')
